cases/openfoam/fluids/backstep_driver_seegmiller_turbulent/solution/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         5000;

deltaT          1;

writeControl    timeStep;
writeInterval   1000;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;
        patches         (lower_wall_downstream);
    }

    // Sample wallShearStress on the lower-wall-downstream patch -> raw file
    // with (x y z tau_x tau_y tau_z) per face. Used for x_reattach extraction.
    wallSurfaceSample
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        surfaceFormat   raw;
        fields          (wallShearStress p);
        surfaces
        {
            wallSurface
            {
                type    patch;
                patches (lower_wall_downstream);
                interpolate false;
            }
        }
    }
}
