cases/openfoam/fluids/backstep_driver_seegmiller_turbulent/solution/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Driver-Seegmiller 1985 backward-facing step (M=0.128, Re_H~36000)
// H = 0.0127 m. Inlet ch height = 8H, outlet ch height = 9H (expansion 1.125).
// Origin at the step lip. Upstream channel y in [0, 8H], x in [-110H, 0].
// Downstream channel y in [-H, 8H], x in [0, 50H]. Step face is the wall
// from (0,-H) to (0,0).
//
// Three blocks: upstream / downstream-upper / downstream-lower.
// Cells: upstream 240x80, ds-upper 220x80, ds-lower 220x32 -> ~46k total.

scale   0.0127;     // length unit = step height H

vertices
(
    (-110   0   0)   //  0  upstream-bottom-front-left
    (   0   0   0)   //  1  step lip front
    (  50   0   0)   //  2  downstream-internal-top-front (x=50H, y=0)
    (   0  -1   0)   //  3  step base front
    (  50  -1   0)   //  4  ds bottom front right
    (-110   8   0)   //  5  upstream top front left
    (   0   8   0)   //  6  upstream top front right / ds-upper top front left
    (  50   8   0)   //  7  ds top front right

    (-110   0   1)   //  8
    (   0   0   1)   //  9
    (  50   0   1)   // 10
    (   0  -1   1)   // 11
    (  50  -1   1)   // 12
    (-110   8   1)   // 13
    (   0   8   1)   // 14
    (  50   8   1)   // 15
);

blocks
(
    // upstream: vertices  0,1,6,5  (front)  8,9,14,13 (back)
    hex (0 1 6 5  8 9 14 13)  (240 80 1) simpleGrading (8 30 1)

    // downstream upper: vertices 1,2,7,6 / 9,10,15,14
    hex (1 2 7 6  9 10 15 14) (220 80 1) simpleGrading (12 30 1)

    // downstream lower: vertices 3,4,2,1 / 11,12,10,9
    hex (3 4 2 1  11 12 10 9) (220 32 1) simpleGrading (12 8 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 8 13 5));
    }
    outlet
    {
        type patch;
        faces
        (
            (2 7 15 10)
            (4 2 10 12)
        );
    }
    upper_wall
    {
        type wall;
        faces
        (
            (5 13 14 6)
            (6 14 15 7)
        );
    }
    lower_wall_upstream
    {
        type wall;
        faces ((0 1 9 8));
    }
    step_face
    {
        type wall;
        faces ((1 3 11 9));
    }
    lower_wall_downstream
    {
        type wall;
        faces ((3 4 12 11));
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 5 6 1)
            (1 6 7 2)
            (3 1 2 4)
            (8 9 14 13)
            (9 10 15 14)
            (11 9 10 12)
        );
    }
);

mergePatchPairs ();
