cases/openfoam/fluids/backstep_driver_seegmiller_turbulent/solution/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Air at room conditions (T=298 K). Re_H = U * H / nu = 44.2 * 0.0127 / 1.56e-5 = 36000.

transportModel  Newtonian;

nu              1.56e-05;
