cases/openfoam/fluids/backstep_driver_seegmiller_turbulent/solution/case/0/U
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions [0 1 -1 0 0 0 0];

internalField uniform (44.2 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (44.2 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (44.2 0 0);
    }
    "(upper_wall|lower_wall_upstream|lower_wall_downstream|step_face)"
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}
