cases/openfoam/fluids/backstep_driver_seegmiller_turbulent/solution/case/0/k
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions [0 2 -2 0 0 0 0];

// Inlet: I=2% turbulence intensity at U=44.2 -> k = 1.5*(I*U)^2 = 1.17
internalField uniform 1.17;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.17;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.17;
        value           uniform 1.17;
    }
    "(upper_wall|lower_wall_upstream|lower_wall_downstream|step_face)"
    {
        type            kqRWallFunction;
        value           uniform 1e-6;
    }
    frontAndBack
    {
        type            empty;
    }
}
