cases/openfoam/fluids/backstep_driver_seegmiller_turbulent/solution/case/0/nut
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    "(upper_wall|lower_wall_upstream|lower_wall_downstream|step_face)"
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}
