cases/openfoam/fluids/backstep_driver_seegmiller_turbulent/solution/case/0/omega
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions [0 0 -1 0 0 0 0];

// Inlet: omega = sqrt(k)/(Cmu^0.25 * l) with l=0.07*H -> ~2220
internalField uniform 2220;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2220;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2220;
        value           uniform 2220;
    }
    "(upper_wall|lower_wall_upstream|lower_wall_downstream|step_face)"
    {
        type            omegaWallFunction;
        value           uniform 2220;
    }
    frontAndBack
    {
        type            empty;
    }
}
